<?php

namespace Database\Seeders;

use App\Models\AboutUs;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class AboutSeederTable extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        AboutUs::create([
            'title' => 'شركة سيراميكا ريماس',
            'description' => 'قم بتحسين نمط حياة عملائنا وتزويدهم بتجربة معيشية أفضل داخل منازلهم من خلال تزويدهم بمنتجات عالية الجودة بتصاميم إبداعية وجذابة من الناحية الجمالية تناسب كل الأذواق التي يتم تقديمها بطريقة أخلاقية وصديقة للبيئة. قدم لوكلائنا سعر منتج تنافسي مع تصميمات فريدة تميزنا عن المنافسة.

                             أن نصبح أحد العشرة الأوائل الأكثر شهرة واحترامًا في صناعة بلاط السيراميك. للتوسع عالميًا والحفاظ على الاعتراف القوي بالعلامة التجارية والحضور في سوق بلاط السيراميك من خلال الاستمرار في تزويد العملاء بأعلى جودة من البلاط مع مجموعة متنوعة من التصميمات المبتكرة.',
            'photo' => 'frontend/assets/images/bg/banner11.jpg',
            'page_title' => "ريماس | حولنا",
            'mission' => 'قم بتحسين نمط حياة عملائنا وتزويدهم بتجربة معيشية أفضل داخل منازلهم من خلال تزويدهم بمنتجات عالية الجودة بتصاميم إبداعية وجذابة من الناحية الجمالية تناسب كل الأذواق التي يتم تقديمها بطريقة أخلاقية وصديقة للبيئة. قدم لوكلائنا سعر منتج تنافسي مع تصميمات فريدة تميزنا عن المنافسة.',
            'vision' => 'أن نصبح أحد العشرة الأوائل الأكثر شهرة واحترامًا في صناعة بلاط السيراميك. للتوسع عالميًا والحفاظ على الاعتراف القوي بالعلامة التجارية والحضور في سوق بلاط السيراميك من خلال الاستمرار في تزويد العملاء بأعلى جودة من البلاط مع مجموعة متنوعة من التصميمات المبتكرة.',
        ]);
    }
}
